hubertciebiada/VdMot_Controller/software_esp32/src/stmApp.cpp
void CStmApp::scanTemps()
{
    tempsCount=0;
    for (uint8_t i=0;i<TEMP_SENSORS_COUNT;i++) {
        memset(tempsId[i].id,0x0,sizeof(tempsId[i].id));
    }
    app_cmd(APP_PRE_SETONEWIRESEARCH);
}

// A sensor that is no longer on the STM's list (failed, removed, STM reset or
// rescanned) gets no new readings: mark its config slot as failed instead of
// keeping the last good value forever. Called when a new list has arrived.
void CStmApp::invalidateMissingTemps()
{
    for (uint8_t x=0;x<TEMP_SENSORS_COUNT;x++) {
        if (temps[x].id[0]=='\0') continue;       // no reading yet
        bool listed=false;
        for (uint8_t i=0;(i<tempsCount) && (i<TEMP_SENSORS_COUNT);i++) {
            if (strncmp(temps[x].id,tempsId[i].id,sizeof(temps[x].id))==0) {
                listed=true;
                break;
            }
        }
        if (!listed) temps[x].temperature=-500;   // STM "no value" sentinel
    }
}

void CStmApp::invalidateMissingVolts()
{
    for (uint8_t x=0;x<VOLT_SENSORS_COUNT;x++) {
        if (volts[x].id[0]=='\0') continue;       // no reading yet
        bool listed=false;
        for (uint8_t i=0;(i<voltsCount) && (i<VOLT_SENSORS_COUNT);i++) {
            if (strncmp(volts[x].id,voltsId[i].id,sizeof(volts[x].id))==0) {
                listed=true;
                break;
            }
        }
        if (!listed) {
            volts[x].vad=-1000;                     // STM "no value" sentinel
            volts[x].failed=true;
        }
    }
}

void CStmApp::matchSensors()
{
    if (VdmConfig.configFlash.netConfig.syslogLevel>=VISMODE_DETAIL) {
        syslog.log(LOG_DEBUG, "stmApp: send match sensor request");
    }
    #ifdef EnvDevelop
        UART_DBG.println("stmApp: send match sensor request");
    #endif
    app_cmd(APP_PRE_MATCHSENS);      
}

void CStmApp::setTempIdx()
{
    String s1;
    String s2;
    uint8_t tIdx1;
    uint8_t tIdx2;
    
    for (uint8_t i=0;i<ACTUATOR_COUNT;i++) {
        tIdx1=StmApp.actuators[i].tIdx1;
        tIdx2=StmApp.actuators[i].tIdx2;
        s1=APP_PRE_UNDEFSENSOR;
        s2=APP_PRE_UNDEFSENSOR;
        if (tIdx1>0) {
            if (strlen(VdmConfig.configFlash.tempsConfig.tempConfig[tIdx1-1].ID)>0) {
                s1=VdmConfig.configFlash.tempsConfig.tempConfig[tIdx1-1].ID;
            }   
        }
        if (tIdx2>0) {
            if (strlen(VdmConfig.configFlash.tempsConfig.tempConfig[tIdx2-1].ID)>0) {
                s2=VdmConfig.configFlash.tempsConfig.tempConfig[tIdx2-1].ID; 
            }
        }
        
        waitForFinishQueue=true;
        fastQueueMode=true;
        waitEEPFinished=true;
        UART_DBG.println("tIdx : "+String(i+1)+"="+String(tIdx1)+":"+s1+","+String(tIdx2)+s2);
        app_cmd(APP_PRE_SETVLVSENSOR,String(i)+ARG_DELIMITER+s1+ARG_DELIMITER+s2);

        fastQueueMode=true;

        if (VdmConfig.configFlash.netConfig.syslogLevel>=VISMODE_DETAIL) {
            syslog.log(LOG_DEBUG,"stmApp: "+String(APP_PRE_SETVLVSENSOR)+" "+String(i)+ARG_DELIMITER+s1+ARG_DELIMITER+s2);
        }
    }
    fastQueueMode=true;
}

void CStmApp::setLearnAfterMovements()
{
    waitForFinishQueue=true;
    waitEEPFinished=true;
    app_cmd(APP_PRE_SETLEARNMOVEM,String(learnAfterMovements));
    fastQueueMode=true;   
}

void CStmApp::setMotorChars()
{
    waitForFinishQueue=true;
    waitEEPFinished=true;
    app_cmd(APP_PRE_SETMOTCHARS,String(motorChars.maxLowCurrent)+ARG_DELIMITER+String(motorChars.maxHighCurrent)+
        ARG_DELIMITER+String(motorChars.startOnPower)+ARG_DELIMITER+String(motorChars.noOfMinCount)+ARG_DELIMITER+String(motorChars.maxCalReps));   
    fastQueueMode=true;
}

void  CStmApp::app_loop() 
{
    static int match_counter = 0;

    app_check_data();
    appHandler();

    // maybe find a better place for this code
    if(matchSensorRequest == true) {
        match_counter++;
        if (match_counter > 30) {
            match_counter = 0;
            matchSensorRequest = false;
            matchSensors();
        }
    }
}

bool CStmApp::checkCmdIsAvailable (String thisCmd)
{   
    uint8_t i=0;
    while (commCmds[i] != NULL) {
        if (strncmp(thisCmd.c_str(),commCmds[i],5)==0) {
            return(true);
        }
        i++;
    }
    #ifdef EnvDevelop
        UART_DBG.println("Command not found "+String(thisCmd));
    #endif
    return (false);
}

void  CStmApp::app_cmd(String command,String args) 
{    
    if (checkCmdIsAvailable(command)) {
        String s=command+ARG_DELIMITER;
        if (args!="") s+=args+ARG_DELIMITER;
        #ifdef EnvDevelop
            UART_DBG.println("push "+s);
        #endif
        Queue.push(s);
    }
    else {
        if (VdmConfig.configFlash.netConfig.syslogLevel>=VISMODE_ATOMIC) {
            syslog.log(LOG_DEBUG, "STMApp: app_cmd - command not found");
        }
    }
}

int8_t CStmApp::findTempID(char* ID) 
{
    for (uint8_t i=0;i<TEMP_SENSORS_COUNT;i++) {
        if (strlen(VdmConfig.configFlash.tempsConfig.tempConfig[i].ID)>0) {
            if (strncmp(ID,VdmConfig.configFlash.tempsConfig.tempConfig[i].ID,sizeof(VdmConfig.configFlash.tempsConfig.tempConfig[i].ID))==0) {
            return (i);
            }
        }
    }
    return -1;
}

int8_t CStmApp::findVoltID(char* ID) 
{
    for (uint8_t i=0;i<VOLT_SENSORS_COUNT;i++) {
        if (strlen(VdmConfig.configFlash.voltsConfig.voltConfig[i].ID)>0) {
            if (strncmp(ID,VdmConfig.configFlash.voltsConfig.voltConfig[i].ID,sizeof(VdmConfig.configFlash.voltsConfig.voltConfig[i].ID))==0) {
            return (i);
            }
        }
    }
    return -1;
}

int8_t CStmApp::findTempIdxInValve (uint8_t tempIdx)
{
  uint8_t idx=0;
  for (uint8_t i=0;i<ACTUATOR_COUNT;i++) {
    if ((StmApp.actuators[i].tIdx1==tempIdx+1) || (StmApp.actuators[i].tIdx2==tempIdx+1)) return (i);
  }
  return (-1);
}


void CStmApp::setSensorIndex(uint8_t valveIndex,char* sensor1,char* sensor2)
{
    int8_t sensorIdx;
    if (valveIndex>=ACTUATOR_COUNT) return;
    sensorIdx=findTempID(sensor1);
    if (sensorIdx>=0) actuators[valveIndex].tIdx1=sensorIdx+1; else actuators[valveIndex].tIdx1=0;
    sensorIdx=findTempID(sensor2);
    if (sensorIdx>=0) actuators[valveIndex].tIdx2=sensorIdx+1; else actuators[valveIndex].tIdx2=0;
}

void  CStmApp::app_check_data() 
{
    static int errorcnt = 0;
    static bool rxOverflow = false;
    uint8_t noToken;
    uint8_t val8;
    String sv;

