hubertciebiada/VdMot_Controller/software_esp32/src/stmApp.cpp
    #ifdef STMSimulation
        #warning STMSimulation active
        appState=APP_IDLE;  
        stmStatus=STM_READY; 
        cmd_buffer=""; 
        return;
    #endif

    found=false;
    bool rxActivity = false;

    // Assemble one line per call. Bytes after the terminator stay in the UART
    // buffer for the next call, so back-to-back replies are not lost. A line
    // longer than the buffer is dropped completely instead of overrunning it.
    while (!found && (UART_STM32.available() > 0)) {
        char c = (char) UART_STM32.read();
        rxActivity = true;
        if ((c == '\r') || (c == '\n')) {
            if (rxOverflow) {
                syslog.log(LOG_DEBUG, "STMApp: line exceeds receive buffer, dropped");
                rxOverflow = false;
                buflen = 0;
            } else if (buflen >= 5) {       // shortest valid reply is a 5-char command
                buffer[buflen] = '\0';
                errorcnt = 0;
                found = true;
                buflen = 0;
                if (VdmConfig.configFlash.netConfig.syslogLevel>=VISMODE_ATOMIC) {
                    syslog.log(LOG_DEBUG, "STMApp:found new data packet: >" + String(buffer) + "<");
                }
            } else {
                buflen = 0;                 // empty line, LF of CR LF or noise
            }
        } else if (rxOverflow) {
            // discard until the end of the oversized line
        } else if (buflen < sizeof(buffer)-1) {
            buffer[buflen++] = c;
        } else {
            rxOverflow = true;
        }
    }

    // timeout incomplete recv sequences (no new byte for ~6 cycles)
    if (!found && ((buflen > 0) || rxOverflow)) {
        if (rxActivity) errorcnt = 0; else errorcnt++;
        if (errorcnt > 5) {
            buffer[buflen] = '\0';
            syslog.log(LOG_DEBUG, "incomplete buffer : >" + String(buffer) + "<");
            errorcnt = 0;
            buflen = 0;
            rxOverflow = false;
        }
    }
   
    if(!found) 
    {
        //syslog.log(LOG_DEBUG, "incomplete buffer : >" + String(buffer) + "<");
    }
    else 
    {
        found = false;

        if (stmStatus==STM_NOT_READY) stmStatus=STM_READY;
        stmFailed=false;
        appTimeOuts=0;      // the STM answers: only consecutive timeouts count
        // devide buffer into command and data
		// ****************************************

        cmdptr = buffer;
        argcnt = 0;
        noToken = 0;
        //UART_DBG.println("cmdbuffer "+String(cmdptr));

        // Returns first token
        char *token = strtok(cmdptr, " ");
        memset(cmd,0x0,sizeof(cmd));
        if (token != NULL) strlcpy(cmd,token,sizeof(cmd));		// command
        // Keep get tokens while one of the
        // delimiters present in buffer.
        //UART_DBG.println("token1 "+String(token));
        while (token != NULL)
        {
            if (noToken>0) { 
                //UART_DBG.println("token "+String(token));
                memset (argptr[noToken-1],0x0,argSize[noToken-1]);
                strncpy(argptr[noToken-1],token,argSize[noToken-1]-1); 
                argcnt++;
            }
            token = strtok(NULL, " ");
            noToken++;
            if (noToken>noOfArgs) break;
        }

        // Only the reply to the outstanding request ends the pending state. A stray
        // line (a reply that came after its timeout, noise) is still applied by its
        // prefix, but pairing it with the current request would put every later
        // reply one line behind. The STM answers a bad gvlon with "goned error".
        APP_STATE stateBefore=appState;
        bool expectedLine=(expectedReply[0]!='\0') && ((strncmp(cmd,expectedReply,5)==0) ||
            ((strncmp(expectedReply,APP_PRE_GETONEWIRESETT,5)==0) && (strncmp(cmd,APP_PRE_GETONEWIREDATA,5)==0)));

		// get actual values
		// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
		if(memcmp(APP_PRE_GETACTUALPOS,cmd,5) == 0) {
            if(argcnt == 2) {
                if (VdmConfig.configFlash.netConfig.syslogLevel>=VISMODE_DETAIL) {
                    syslog.log(LOG_DEBUG,"STMApp:actual position answer "+String(argptr[0])+" : "+String(argptr[1]));
                }
                int idx=atoi(argptr[0]);
                if ((idx>=0) && (idx<ACTUATOR_COUNT)) actuators[idx].actual_position = atoi(argptr[1]);
            }
            appState=APP_IDLE;
        }

        // get mean current 
		// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
		else if(memcmp(APP_PRE_GETMEANCURR,cmd,5) == 0) {
            if(argcnt == 2) {
                if (VdmConfig.configFlash.netConfig.syslogLevel>=VISMODE_DETAIL) {
                    syslog.log(LOG_DEBUG,"STMApp:mean current answer "+String(argptr[0])+" : "+String(argptr[1]));  
                }
                int idx=atoi(argptr[0]);
                if ((idx>=0) && (idx<ACTUATOR_COUNT)) actuators[idx].meancurrent = atoi(argptr[1]);
            }
            appState=APP_IDLE;
        }
    
        // get valve status
		// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
		else if(memcmp(APP_PRE_GETVLSTATUS,cmd,5) == 0) { 
            if(argcnt == 2) {
                if (VdmConfig.configFlash.netConfig.syslogLevel>=VISMODE_DETAIL) {
                    syslog.log(LOG_DEBUG,"STMApp:valve status "+String(argptr[1]));
                }
                int nActuators = atoi(argptr[0]);
                if (nActuators > ACTUATOR_COUNT) nActuators = ACTUATOR_COUNT;
                char* cmdptr;
                char* ps=argptr[1];
                for (int idx=0; idx<nActuators;idx++) {
                    if ((cmdptr=strchr(ps,','))!=NULL) *cmdptr='\0';
                    val8 = atoi(ps);
                    actuators[idx].state = (val8 & 0x7f);
                    actuators[idx].calibration =  (val8>=0x80);
                    if (cmdptr==NULL) break;    // list shorter than announced
                    ps=cmdptr+1;
                }
                stmStatus=STM_READ_ALL_FROM_QUEUE;  
                if (stmInitState==STM_INIT_STARTED) stmInitState=STM_INIT_FINISHED ;
            }
            appState=APP_IDLE;
        }

        // get set target answer
		// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
		else if(memcmp(APP_PRE_SETTARGETPOS,cmd,5) == 0) {
            if(argcnt == 0) {
                settarget_check = true; 
            }
            // the target went through: no resend
            if (expectedLine && (pendingTargetValve<ACTUATOR_COUNT)) {
                targetResends[pendingTargetValve]=0;
                pendingTargetValve=NO_PENDING_TARGET;
            }
            if (strncmp(cmd,cmd_buffer.c_str(),5) ==0) cmd_buffer="";
            appState=APP_IDLE;
        }
        // get target position
            // ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
            else if(memcmp(APP_PRE_GETTARGETPOS,cmd,5) == 0) {
                if(argcnt == 2) {
                    int idx=atoi(argptr[0]);
                    if ((idx>=0) && (idx<ACTUATOR_COUNT)) actuators[idx].target_position = atoi(argptr[1]);
                }
                appState=APP_IDLE;
            }

        // get data values
		// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
		else if(memcmp(APP_PRE_GETVLVDATA,cmd,5) == 0) {
            if(argcnt >= 6) {
                int idx=atoi(argptr[0]);
                if((idx>=0) && (idx < ACTUATOR_COUNT)) {
                    actuators[idx].actual_position = atoi(argptr[1]);
                    actuators[idx].meancurrent = atoi(argptr[2]);
                    val8 = atoi(argptr[3]);
                    actuators[idx].state = (val8 & 0x7f);
                    actuators[idx].calibration = (val8>=0x80);
                    // STM sentinels (-500 no value, -1270 read error) must stay <= -500
                    int16_t t1=atoi(argptr[4]);
                    int16_t t2=atoi(argptr[5]);
                    actuators[idx].temp1 = (t1<=-500) ? t1 : ConvertCF(t1)+getTOffset(actuators[idx].tIdx1);
                    actuators[idx].temp2 = (t2<=-500) ? t2 : ConvertCF(t2)+getTOffset(actuators[idx].tIdx2);
                    if (argcnt >= 10) {
                        actuators[idx].movements = atoi(argptr[6]);   
                        actuators[idx].opening_count = atoi(argptr[7]);
                        actuators[idx].closing_count = atoi(argptr[8]);
                        actuators[idx].deadzone_count = atoi(argptr[9]); 
                    }
                    if (argcnt >= 11) {
                        actuators[idx].calibRetries = atoi(argptr[10]); 
                    }
                    if (VdmConfig.configFlash.netConfig.syslogLevel>=VISMODE_DETAIL) {
                        syslog.log(LOG_DEBUG, "STMApp:got valve data #"+String(argptr[0])+" pos:"+String(argptr[1])+
                        " mean:"+String(argptr[2])+" state:"+String(argptr[3])+" t1:"+String(argptr[4])+" t2:"+String(argptr[5]));
                    }

                    if (actuators[idx].state!=actuators[idx].lastState) {
                        switch (actuators[idx].state) {
                            case VLV_STATE_OPENING:
                            case VLV_STATE_CLOSING:
                            {
                                actuators[idx].worked = true;
                                break;    
                            }
                            case VLV_STATE_FAILED:
                            {
                                if (VdmConfig.configFlash.messengerConfig.reason.reasonFlags.valveFailed) {
                                    String title = String(VdmConfig.configFlash.systemConfig.stationName) + " : Valve" ;
                                    String s = "Valve "+String(idx+1)+" failed";
                                    Messenger.sendMessage (title.c_str(),s.c_str());
                                }
                                break;
                            }
                            case VLV_STATE_OPENCIR:
                            {
                                if ((actuators[idx].worked) && (VdmConfig.configFlash.valvesConfig.valveConfig[idx].active)) { // has previous worked correctly
                                    if (VdmConfig.configFlash.messengerConfig.reason.reasonFlags.notDetect) {
                                        String title = String(VdmConfig.configFlash.systemConfig.stationName) + " : Valve" ;
                                        String s = "Valve "+String(idx+1)+" is not connected";
                                        Messenger.sendMessage (title.c_str(),s.c_str());
                                    }
                                }
                                break;
                            }
                            case VLV_STATE_BLOCKS:
                            {
                                if (VdmConfig.configFlash.messengerConfig.reason.reasonFlags.valveBlocked) {
                                    String title = String(VdmConfig.configFlash.systemConfig.stationName) + " : Valve" ;
                                    String s = "Valve "+String(idx+1)+" is blocked";
                                    Messenger.sendMessage (title.c_str(),s.c_str());
                                }
                                break;
                            }
                        } 
                    }
                    actuators[idx].lastState=actuators[idx].state;
                }
            } 
            appState=APP_IDLE;
        }

        // get temp onewire data answer
		// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
        
        else if(memcmp(APP_PRE_GETONEWIRECNT,cmd,5) == 0) {
            if(argcnt == 1) {
                tempsPrivCount= constrain(atoi(argptr[0]),0,TEMP_SENSORS_COUNT); 
                // "N 0" is also the reply to the list request on an empty bus
                if (tempsPrivCount==0) tempsCount=0;
                if (tempsPrivCount!=tempsCount) app_cmd(APP_PRE_GETONEWIRECNT,String(255));
                if (VdmConfig.configFlash.netConfig.syslogLevel>=VISMODE_DETAIL) {
                    syslog.log(LOG_DEBUG,"STMApp:one wire temp count "+String(tempsPrivCount));
                }       
            }
            if(argcnt == 2) {
                if (VdmConfig.configFlash.netConfig.syslogLevel>=VISMODE_DETAIL) {
                    syslog.log(LOG_DEBUG,"STMApp:one wire temp data "+String(argptr[1]));
                } 
                int nItems= constrain(atoi(argptr[0]),0,TEMP_SENSORS_COUNT);
                int idx=0;
                char* cmdptr;
                char* ps=argptr[1];
                while (idx<nItems) {
                    if ((cmdptr=strchr(ps,','))!=NULL) *cmdptr='\0';
                    strlcpy(tempsId[idx].id,ps,sizeof(tempsId[idx].id));
                    idx++;
                    if (cmdptr==NULL) break;    // list shorter than announced
                    ps=cmdptr+1;
                }
                tempsPrivCount=idx;
                tempsCount=tempsPrivCount;
            }
            if ((argcnt==2) || ((argcnt==1) && (tempsPrivCount==0))) invalidateMissingTemps();
            if (tempsPrivCount==0) {
                fastGetOneWire=false;
               // oneWireAllRead=true;
            }
            appState=APP_IDLE;
        }

		else if(memcmp(APP_PRE_GETONEWIREDATA,cmd,5) == 0) {
            if(argcnt == 2) {
                if (VdmConfig.configFlash.netConfig.syslogLevel>=VISMODE_DETAIL) {
                    syslog.log(LOG_DEBUG,"STMApp:one wire temp data "+String(argptr[0])+":"+String(argptr[1]));
                } 
                strlcpy(tempsId[tempIndex].id,argptr[0],sizeof(tempsId[tempIndex].id));

